# Во втором массиве сохранить индексы четных элементов первого массива. Например, если дан массив со значениями 8, 3,
# 15, 6, 4, 2, то во второй массив надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 – если индексация начинается
# с нуля), т.к. именно в этих позициях первого массива стоят четные числа.
import random

array = [random.randint(0, 100) for _ in range(10)]
result = []

i = 0
for num in array:
    if num % 2 == 0:
        result.append(i)
    i += 1

print(f'Исходный массив: {array}')
print(f'Результат: {result}')
